tutorials/fsiFoam/3dTube/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    symmetry-x
    {
        type         symmetryPlane;
    }
    symmetry-y
    {
        type         symmetryPlane;
    }
    outlet
    {
        type         zeroGradient;
    }
    inlet
    {
        type         zeroGradient;
    }
    wall
    {
        type         movingWallVelocity;
        value        uniform (0 0 0);
    }
}


// ************************************************************************* //
